;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el
(package! link-hint :built-in 'prefer  :pin "54612293cc4e01df639c41597cb83a633b0f5514")
(package! expand-region :built-in 'prefer :pin "c5c4362741deebb0985a8a29f9b8b0e25160764a")
(package! which-key :built-in 'prefer :pin "8093644032854b1cdf3245ce4e3c7b6673f741bf")
(package! debbugs :built-in 'prefer :pin "7f21c4c778e75b12dfc4cfa62a89c4b0dd06c9c3")
(package! org-roam :built-in 'prefer :pin "7f453f3fffb924ca4ae3f8d34cabc03fbcae0127")
(package! flycheck :built-in 'prefer :pin "8541a61053bba1f2f31d0791e597cd3c78a21456")
(package! flycheck-guile :built-in 'prefer :recipe (:host github :repo "flatwhatson/flycheck-guile") :pin "e46d6e5453dd7471309fae6549445c48e6d8f340")
(package! rmsbolt :built-in 'prefer :pin "f3c56ba6949934758e79a371eb5a29d8e832a828")
(package! guix :built-in 'prefer :pin "c9aef52121b458297e70bb50f49f7276b4a8d759")
(package! fd-dired :built-in 'prefer :pin "458464771bb220b6eb87ccfd4c985c436e57dc7e")
(package! emms :built-in 'prefer :pin "061b36c5627706b2a7e4a636ed9644bb68e800bb")
(package! osm :built-in 'prefer :pin "808baabecd9882736b240e6ea9344047aeb669e2")
(package! multiple-cursors :built-in 'prefer :pin "225fc0e889e094bfd2913cfd448084cb49211ac6")
(package! minions :built-in 'prefer :pin "19dae1c41542777cb5b0311b6e2e77f43e2fd407")
(package! transmission :built-in 'prefer :pin "a03a6f5c7b133e0a37896b6d993dd6d6d4532cc2")
(package! yaml-mode :built-in 'prefer :pin "535273d5a1eb76999d20afbcf4d9f056d8ffd2da")
(package! undo-tree :built-in 'prefer :pin "16f4121032d09ef44b3d7d02c4d02c3c2f18041f")
(package! switch-window :built-in 'prefer :pin "71ef2f54c97f3fd2e7ff7964d82e6562eb6282f7")
(package! pass :built-in 'prefer :pin "5651da53137db9adcb125b4897c2fe27eeb4368d")
(package! password-store :built-in 'prefer :pin "c4d8a1d815e79ddd89a85d3e36a41d29f0475771")
(package! orgit :built-in 'prefer :pin "b33b916915db5f91d2c9da4cb1a2457ccbb09332")
(package! magit :built-in 'prefer :pin "9ffaed3f6bc743abd88402c412b970fc2ae2ea91")
(package! forge :built-in 'prefer :pin "9556d3b4c20bf405390d0931d77c9f012f8e843f")
(package! magit-todos :built-in 'prefer :pin "67fd80c2f10aec4d5b2a24b5d3d53c08cc1f05dc")
(package! vterm :built-in 'prefer :pin "3155a477b43c1567d754768f5be79296440ebaf8")
(package! cfrs :built-in 'prefer :pin "f3a21f237b2a54e6b9f8a420a9da42b4f0a63121") ; treemacs dep
(package! modus-themes :built-in 'prefer :pin "2b0c31b94ddb82307181dcf0078cee2f3c187aec")
(package! flycheck-popup-tip :built-in 'prefer :pin "ef86aad907f27ca076859d8d9416f4f7727619c6")
(package! orgit-forge :built-in 'prefer :pin "8baf1dee795f026d4555687022487fab89c9bcdf")
(package! code-review :built-in 'prefer :pin "95b36ec8e7935f96b2f3c6c9086d49cf4a72cbff" :recipe (:files ("graphql" "code-review*.el")))
(package! gcmh :built-in 'prefer)
(package! company :built-in 'prefer); MAYBE replace with corfu, corfu-terminal and cape
(package! treemacs :built-in 'prefer)
(package! treemacs-magit :built-in 'prefer)
(package! lsp-treemacs :built-in 'prefer)
(package! realgud :built-in 'prefer)
(package! dap-mode :built-in 'prefer)
(package! lsp-mode :built-in 'prefer)
(package! lsp-ui :built-in 'prefer)
(package! drag-stuff :built-in 'prefer)
(package! explain-pause-mode :built-in 'prefer)
(package! pcre2el :built-in 'prefer)
(package! smartparens :built-in 'prefer)
(package! project :built-in 'prefer)
(package! geiser-guile :built-in 'prefer)
(package! geiser :built-in 'prefer)
(package! macrostep-geiser :built-in 'prefer)
(package! rustic :built-in 'prefer)
(package! ws-butler :built-in 'prefer); doom forked
(package! general :built-in 'prefer); issues with binding?
;(package! helpful :built-in 'prefer :pin "209971ba9f576ba080352642cfbf25df5692b1d7"); BUG in 0.19 fixed on master for emacs 29
(package! projectile :built-in 'prefer); doom version managed packages
(package! treemacs-projectile :built-in 'prefer) ; built-in project.el
(package! all-the-icons :built-in 'prefer)
(package! rainbow-delimiters :built-in 'prefer)
(package! dtrt-indent :built-in 'prefer)
(package! posframe :built-in 'prefer)
(package! restart-emacs :built-in 'prefer)
(package! highlight-numbers :built-in 'prefer)
(package! hide-mode-line :built-in 'prefer)
(package! avy :built-in 'prefer)
;(package! company-dict :built-in 'prefer); MAYBE add guix elisp package(s)
;(package! better-jumper :built-in 'prefer)
;(package! auto-minor-mode :built-in 'prefer)
;(package! magit-gitflow :pin "cc41b561ec6eea947fe9a176349fb4f771ed865b")
;(package! clipetty :pin "01b39044b9b65fa4ea7d3166f8b1ffab6f740362")
;(package! tree-sitter :built-in 'prefer)
;(package! tree-sitter-lang :built-in 'prefer)
;(package! treemacs-persp :built-in 'prefer)
;(unpin! rmsbolt guix fd-dired emms)
;(package! esup)
